
## Plan Result

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/18515721581)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_pages_project.ruzickap_github_io


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_pages_project.ruzickap_github_io will be updated in-place
  ~ resource "cloudflare_pages_project" "ruzickap_github_io" {
      - build_config         = {} -> null
      ~ canonical_deployment = {
          + aliases            = (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-10-10T16:16:15Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  ~ commit_hash    = "4a5dd6751203b905a94488e41ebaf67876b3456f" -> (known after apply)
                  ~ commit_message = "feat: update EKS tasks and add Grafana Mimir post" -> (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "9d29bb6e-94b4-4977-8b15-74c3555de478" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-10-10T16:16:17Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-10-10T16:16:17Z" -> (known after apply)
          ~ project_id         = "59418a45-7a28-47bc-9b3a-12d9d882a4f3" -> (known after apply)
          ~ project_name       = "ruzickap-github-io" -> (known after apply)
          ~ short_id           = "9d29bb6e" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-10-10T16:16:15Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-10-10T16:16:17Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://9d29bb6e.ruzickap-github-io.pages.dev" -> (known after apply)
        } -> (known after apply)
      ~ created_on           = "2025-06-25T13:46:04Z" -> (known after apply)
      - deployment_configs   = {
          - preview    = {
              - compatibility_date  = "2025-06-25" -> null
              - compatibility_flags = [] -> null
            } -> null
          - production = {
              - compatibility_date  = "2025-06-25" -> null
              - compatibility_flags = [] -> null
            } -> null
        } -> null
      ~ domains              = [
          - "ruzickap-github-io.pages.dev",
        ] -> (known after apply)
        id                   = "ruzickap-github-io"
      ~ latest_deployment    = {
          + aliases            = (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-10-10T16:16:15Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  ~ commit_hash    = "4a5dd6751203b905a94488e41ebaf67876b3456f" -> (known after apply)
                  ~ commit_message = "feat: update EKS tasks and add Grafana Mimir post" -> (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "9d29bb6e-94b4-4977-8b15-74c3555de478" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-10-10T16:16:17Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-10-10T16:16:17Z" -> (known after apply)
          ~ project_id         = "59418a45-7a28-47bc-9b3a-12d9d882a4f3" -> (known after apply)
          ~ project_name       = "ruzickap-github-io" -> (known after apply)
          ~ short_id           = "9d29bb6e" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-10-10T16:16:15Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-10-10T16:16:17Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://9d29bb6e.ruzickap-github-io.pages.dev" -> (known after apply)
        } -> (known after apply)
        name                 = "ruzickap-github-io"
      ~ subdomain            = "ruzickap-github-io.pages.dev" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tofu-cloudflare","PRNumber":239,"Program":"tfcmt","SHA1":"9e5b85694b3367b413850aaeab277bb6f9ed81de","Vars":{},"WorkflowName":"tofu-cloudflare"} -->